In [2]:
import pandas as pd 
import numpy as np

In [3]:
s = pd.Series([1,3,5,np.nan, 6,8])

In [4]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [10]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df = pd.DataFrame(np.random.randn(6,4)
                  , index=dates
                  , columns=list('ABCD'))

In [12]:
df

                   A         B         C         D
2013-01-01 -0.096332 -0.196267  2.061296  1.584049
2013-01-02  1.733757 -0.168242  1.013342  0.209234
2013-01-03 -0.870693 -2.585354 -2.163740  0.260902
2013-01-04  1.644220 -0.783130 -0.152806  0.557064
2013-01-05  0.516839  0.945811 -0.741868 -0.098222
2013-01-06  2.337356  1.119830 -0.175631  1.006755

In [14]:
df2 = pd.DataFrame({'A':1.,
                    'B':pd.Timestamp('20130102'),
                    'C':pd.Series(1, index=list(range(4))),
                    'D':np.array([3]*4, dtype='int32'),
                    'E':pd.Categorical(["test","train","test","train"]),
                    'F':'foo'})
df2

     A          B  C  D      E    F
0  1.0 2013-01-02  1  3   test  foo
1  1.0 2013-01-02  1  3  train  foo
2  1.0 2013-01-02  1  3   test  foo
3  1.0 2013-01-02  1  3  train  foo

In [24]:
df.head()

                   A         B         C         D
2013-01-01 -0.096332 -0.196267  2.061296  1.584049
2013-01-02  1.733757 -0.168242  1.013342  0.209234
2013-01-03 -0.870693 -2.585354 -2.163740  0.260902
2013-01-04  1.644220 -0.783130 -0.152806  0.557064
2013-01-05  0.516839  0.945811 -0.741868 -0.098222

In [25]:
df.tail(3)

                   A         B         C         D
2013-01-04  1.644220 -0.783130 -0.152806  0.557064
2013-01-05  0.516839  0.945811 -0.741868 -0.098222
2013-01-06  2.337356  1.119830 -0.175631  1.006755

In [26]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df.values

array([[-0.09633212, -0.19626698,  2.06129635,  1.58404861],
       [ 1.73375702, -0.1682424 ,  1.01334197,  0.20923426],
       [-0.87069308, -2.58535436, -2.16373976,  0.26090222],
       [ 1.64421998, -0.7831298 , -0.15280606,  0.55706439],
       [ 0.51683863,  0.94581091, -0.74186844, -0.09822228],
       [ 2.33735624,  1.11982991, -0.17563105,  1.006755  ]])

In [28]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.877524 -0.277892 -0.026568  0.586630
std    1.231813  1.345318  1.453128  0.614780
min   -0.870693 -2.585354 -2.163740 -0.098222
25%    0.056961 -0.636414 -0.600309  0.222151
50%    1.080529 -0.182255 -0.164219  0.408983
75%    1.711373  0.667298  0.721805  0.894332
max    2.337356  1.119830  2.061296  1.584049

In [29]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.096332    1.733757   -0.870693    1.644220    0.516839    2.337356
B   -0.196267   -0.168242   -2.585354   -0.783130    0.945811    1.119830
C    2.061296    1.013342   -2.163740   -0.152806   -0.741868   -0.175631
D    1.584049    0.209234    0.260902    0.557064   -0.098222    1.006755

In [37]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.584049  2.061296 -0.196267 -0.096332
2013-01-02  0.209234  1.013342 -0.168242  1.733757
2013-01-03  0.260902 -2.163740 -2.585354 -0.870693
2013-01-04  0.557064 -0.152806 -0.783130  1.644220
2013-01-05 -0.098222 -0.741868  0.945811  0.516839
2013-01-06  1.006755 -0.175631  1.119830  2.337356

In [39]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-03 -0.870693 -2.585354 -2.163740  0.260902
2013-01-04  1.644220 -0.783130 -0.152806  0.557064
2013-01-01 -0.096332 -0.196267  2.061296  1.584049
2013-01-02  1.733757 -0.168242  1.013342  0.209234
2013-01-05  0.516839  0.945811 -0.741868 -0.098222
2013-01-06  2.337356  1.119830 -0.175631  1.006755

# selection

In [40]:
dates = pd.date_range('1/1/2000', periods=8)

In [41]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [42]:
df=pd.DataFrame(np.random.randn(8,4), index=dates, columns=['A','B','C','D'])

In [43]:
df

                   A         B         C         D
2000-01-01  1.350647 -1.038579  0.054502  0.345558
2000-01-02  2.870900 -0.359344  1.319081  0.335568
2000-01-03  0.503640 -1.099415  0.233002  0.611914
2000-01-04 -0.958737  0.606821 -0.458531 -1.307417
2000-01-05  1.059014  0.982977  0.996888 -1.167455
2000-01-06 -0.051939 -0.590335 -1.063429  0.425375
2000-01-07 -0.032117 -1.705473 -1.392565  0.559509
2000-01-08 -0.641326 -0.126865  0.365669 -0.916500

In [44]:
s = df['A']

In [46]:
s[dates[5]]

-0.05193880095994367

In [47]:
df

                   A         B         C         D
2000-01-01  1.350647 -1.038579  0.054502  0.345558
2000-01-02  2.870900 -0.359344  1.319081  0.335568
2000-01-03  0.503640 -1.099415  0.233002  0.611914
2000-01-04 -0.958737  0.606821 -0.458531 -1.307417
2000-01-05  1.059014  0.982977  0.996888 -1.167455
2000-01-06 -0.051939 -0.590335 -1.063429  0.425375
2000-01-07 -0.032117 -1.705473 -1.392565  0.559509
2000-01-08 -0.641326 -0.126865  0.365669 -0.916500

In [48]:
df[['B','A']] = df[['A','B']]

In [49]:
df

                   A         B         C         D
2000-01-01 -1.038579  1.350647  0.054502  0.345558
2000-01-02 -0.359344  2.870900  1.319081  0.335568
2000-01-03 -1.099415  0.503640  0.233002  0.611914
2000-01-04  0.606821 -0.958737 -0.458531 -1.307417
2000-01-05  0.982977  1.059014  0.996888 -1.167455
2000-01-06 -0.590335 -0.051939 -1.063429  0.425375
2000-01-07 -1.705473 -0.032117 -1.392565  0.559509
2000-01-08 -0.126865 -0.641326  0.365669 -0.916500

In [50]:
df[['A','B']]

                   A         B
2000-01-01 -1.038579  1.350647
2000-01-02 -0.359344  2.870900
2000-01-03 -1.099415  0.503640
2000-01-04  0.606821 -0.958737
2000-01-05  0.982977  1.059014
2000-01-06 -0.590335 -0.051939
2000-01-07 -1.705473 -0.032117
2000-01-08 -0.126865 -0.641326

In [56]:
df.loc[:,['B','A']] = df[['A','B']]

In [57]:
df[['A','B']]

                   A         B
2000-01-01 -1.038579  1.350647
2000-01-02 -0.359344  2.870900
2000-01-03 -1.099415  0.503640
2000-01-04  0.606821 -0.958737
2000-01-05  0.982977  1.059014
2000-01-06 -0.590335 -0.051939
2000-01-07 -1.705473 -0.032117
2000-01-08 -0.126865 -0.641326

In [58]:
df.loc[:,['B','A']] = df[['A','B']].values

In [59]:
df[['A','B']]

                   A         B
2000-01-01  1.350647 -1.038579
2000-01-02  2.870900 -0.359344
2000-01-03  0.503640 -1.099415
2000-01-04 -0.958737  0.606821
2000-01-05  1.059014  0.982977
2000-01-06 -0.051939 -0.590335
2000-01-07 -0.032117 -1.705473
2000-01-08 -0.641326 -0.126865

In [61]:
x = pd.DataFrame({'x':[1,2,3], 'y':[3,4,5]})

In [62]:
x.iloc[1] = dict(x=9, y=99)

In [63]:
x

   x   y
0  1   3
1  9  99
2  3   5

In [64]:
df['A']

2000-01-01    1.350647
2000-01-02    2.870900
2000-01-03    0.503640
2000-01-04   -0.958737
2000-01-05    1.059014
2000-01-06   -0.051939
2000-01-07   -0.032117
2000-01-08   -0.641326
Freq: D, Name: A, dtype: float64

In [65]:
df[0:3]

                   A         B         C         D
2000-01-01  1.350647 -1.038579  0.054502  0.345558
2000-01-02  2.870900 -0.359344  1.319081  0.335568
2000-01-03  0.503640 -1.099415  0.233002  0.611914

In [66]:
df['20000102':'20000104']

                   A         B         C         D
2000-01-02  2.870900 -0.359344  1.319081  0.335568
2000-01-03  0.503640 -1.099415  0.233002  0.611914
2000-01-04 -0.958737  0.606821 -0.458531 -1.307417

In [68]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [67]:
df.loc[dates[0]]

A    1.350647
B   -1.038579
C    0.054502
D    0.345558
Name: 2000-01-01 00:00:00, dtype: float64

In [69]:
df.loc[:,['A','B']]

                   A         B
2000-01-01  1.350647 -1.038579
2000-01-02  2.870900 -0.359344
2000-01-03  0.503640 -1.099415
2000-01-04 -0.958737  0.606821
2000-01-05  1.059014  0.982977
2000-01-06 -0.051939 -0.590335
2000-01-07 -0.032117 -1.705473
2000-01-08 -0.641326 -0.126865

In [71]:
df.loc['20000102':'20000104', ['A','B']]

                   A         B
2000-01-02  2.870900 -0.359344
2000-01-03  0.503640 -1.099415
2000-01-04 -0.958737  0.606821

In [72]:
df.loc[dates[0],'A']

1.3506469884979821

In [73]:
df.at[dates[0],'A']

1.3506469884979821

# selection by position

In [74]:
df.iloc[3]

A   -0.958737
B    0.606821
C   -0.458531
D   -1.307417
Name: 2000-01-04 00:00:00, dtype: float64

In [75]:
df.iloc[3:5, 0:2]

                   A         B
2000-01-04 -0.958737  0.606821
2000-01-05  1.059014  0.982977

In [76]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2000-01-02  2.870900  1.319081
2000-01-03  0.503640  0.233002
2000-01-05  1.059014  0.996888

In [77]:
df.iloc[1:3, :]

                  A         B         C         D
2000-01-02  2.87090 -0.359344  1.319081  0.335568
2000-01-03  0.50364 -1.099415  0.233002  0.611914

In [78]:
df.iloc[:,1:3]

                   B         C
2000-01-01 -1.038579  0.054502
2000-01-02 -0.359344  1.319081
2000-01-03 -1.099415  0.233002
2000-01-04  0.606821 -0.458531
2000-01-05  0.982977  0.996888
2000-01-06 -0.590335 -1.063429
2000-01-07 -1.705473 -1.392565
2000-01-08 -0.126865  0.365669

In [79]:
df.iloc[1,1]

-0.3593443717783095

In [82]:
df.iat[1,1]

-0.3593443717783095

In [91]:
df.loc[:,['A','B']]  #비교

                   A         B
2000-01-01  1.350647 -1.038579
2000-01-02  2.870900 -0.359344
2000-01-03  0.503640 -1.099415
2000-01-04 -0.958737  0.606821
2000-01-05  1.059014  0.982977
2000-01-06 -0.051939 -0.590335
2000-01-07 -0.032117 -1.705473
2000-01-08 -0.641326 -0.126865

In [92]:
df[df.A > 0]

                   A         B         C         D
2000-01-01  1.350647 -1.038579  0.054502  0.345558
2000-01-02  2.870900 -0.359344  1.319081  0.335568
2000-01-03  0.503640 -1.099415  0.233002  0.611914
2000-01-05  1.059014  0.982977  0.996888 -1.167455

In [93]:
df[df>0]

                   A         B         C         D
2000-01-01  1.350647       NaN  0.054502  0.345558
2000-01-02  2.870900       NaN  1.319081  0.335568
2000-01-03  0.503640       NaN  0.233002  0.611914
2000-01-04       NaN  0.606821       NaN       NaN
2000-01-05  1.059014  0.982977  0.996888       NaN
2000-01-06       NaN       NaN       NaN  0.425375
2000-01-07       NaN       NaN       NaN  0.559509
2000-01-08       NaN       NaN  0.365669       NaN

In [96]:
df2 = df.copy()

In [97]:
df2

                   A         B         C         D
2000-01-01  1.350647 -1.038579  0.054502  0.345558
2000-01-02  2.870900 -0.359344  1.319081  0.335568
2000-01-03  0.503640 -1.099415  0.233002  0.611914
2000-01-04 -0.958737  0.606821 -0.458531 -1.307417
2000-01-05  1.059014  0.982977  0.996888 -1.167455
2000-01-06 -0.051939 -0.590335 -1.063429  0.425375
2000-01-07 -0.032117 -1.705473 -1.392565  0.559509
2000-01-08 -0.641326 -0.126865  0.365669 -0.916500

In [98]:
df2['E'] = ['one','one','two','three','four','three','three','three']

In [99]:
df2

                   A         B         C         D      E
2000-01-01  1.350647 -1.038579  0.054502  0.345558    one
2000-01-02  2.870900 -0.359344  1.319081  0.335568    one
2000-01-03  0.503640 -1.099415  0.233002  0.611914    two
2000-01-04 -0.958737  0.606821 -0.458531 -1.307417  three
2000-01-05  1.059014  0.982977  0.996888 -1.167455   four
2000-01-06 -0.051939 -0.590335 -1.063429  0.425375  three
2000-01-07 -0.032117 -1.705473 -1.392565  0.559509  three
2000-01-08 -0.641326 -0.126865  0.365669 -0.916500  three

In [108]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20000102', periods=6))

In [109]:
s1

2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int64

In [110]:
df['F'] = s1

In [112]:
df.at[dates[0],'A'] = 0

In [111]:
df

                   A         B         C         D    F
2000-01-01  0.000000 -1.038579  0.054502  0.345558  NaN
2000-01-02  2.870900 -0.359344  1.319081  0.335568  1.0
2000-01-03  0.503640 -1.099415  0.233002  0.611914  2.0
2000-01-04 -0.958737  0.606821 -0.458531 -1.307417  3.0
2000-01-05  1.059014  0.982977  0.996888 -1.167455  4.0
2000-01-06 -0.051939 -0.590335 -1.063429  0.425375  5.0
2000-01-07 -0.032117 -1.705473 -1.392565  0.559509  6.0
2000-01-08 -0.641326 -0.126865  0.365669 -0.916500  NaN

In [113]:
df.iat[0,1] = 0

In [114]:
df

                   A         B         C         D    F
2000-01-01  0.000000  0.000000  0.054502  0.345558  NaN
2000-01-02  2.870900 -0.359344  1.319081  0.335568  1.0
2000-01-03  0.503640 -1.099415  0.233002  0.611914  2.0
2000-01-04 -0.958737  0.606821 -0.458531 -1.307417  3.0
2000-01-05  1.059014  0.982977  0.996888 -1.167455  4.0
2000-01-06 -0.051939 -0.590335 -1.063429  0.425375  5.0
2000-01-07 -0.032117 -1.705473 -1.392565  0.559509  6.0
2000-01-08 -0.641326 -0.126865  0.365669 -0.916500  NaN

In [115]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [116]:
df

                   A         B         C  D    F
2000-01-01  0.000000  0.000000  0.054502  5  NaN
2000-01-02  2.870900 -0.359344  1.319081  5  1.0
2000-01-03  0.503640 -1.099415  0.233002  5  2.0
2000-01-04 -0.958737  0.606821 -0.458531  5  3.0
2000-01-05  1.059014  0.982977  0.996888  5  4.0
2000-01-06 -0.051939 -0.590335 -1.063429  5  5.0
2000-01-07 -0.032117 -1.705473 -1.392565  5  6.0
2000-01-08 -0.641326 -0.126865  0.365669  5  NaN

In [117]:
df3 = df.copy()

In [118]:
df3[df3>0] = -df3

In [119]:
df3

                   A         B         C  D    F
2000-01-01  0.000000  0.000000 -0.054502 -5  NaN
2000-01-02 -2.870900 -0.359344 -1.319081 -5 -1.0
2000-01-03 -0.503640 -1.099415 -0.233002 -5 -2.0
2000-01-04 -0.958737 -0.606821 -0.458531 -5 -3.0
2000-01-05 -1.059014 -0.982977 -0.996888 -5 -4.0
2000-01-06 -0.051939 -0.590335 -1.063429 -5 -5.0
2000-01-07 -0.032117 -1.705473 -1.392565 -5 -6.0
2000-01-08 -0.641326 -0.126865 -0.365669 -5  NaN

In [121]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])

In [122]:
df1

                   A         B         C  D    F   E
2000-01-01  0.000000  0.000000  0.054502  5  NaN NaN
2000-01-02  2.870900 -0.359344  1.319081  5  1.0 NaN
2000-01-03  0.503640 -1.099415  0.233002  5  2.0 NaN
2000-01-04 -0.958737  0.606821 -0.458531  5  3.0 NaN

In [123]:
df1.loc[dates[0]:dates[1],'E'] = 1

In [124]:
df1

                   A         B         C  D    F    E
2000-01-01  0.000000  0.000000  0.054502  5  NaN  1.0
2000-01-02  2.870900 -0.359344  1.319081  5  1.0  1.0
2000-01-03  0.503640 -1.099415  0.233002  5  2.0  NaN
2000-01-04 -0.958737  0.606821 -0.458531  5  3.0  NaN

In [125]:
df1.dropna(how='any')

                 A         B         C  D    F    E
2000-01-02  2.8709 -0.359344  1.319081  5  1.0  1.0

In [126]:
df1.fillna(value=5)

                   A         B         C  D    F    E
2000-01-01  0.000000  0.000000  0.054502  5  5.0  1.0
2000-01-02  2.870900 -0.359344  1.319081  5  1.0  1.0
2000-01-03  0.503640 -1.099415  0.233002  5  2.0  5.0
2000-01-04 -0.958737  0.606821 -0.458531  5  3.0  5.0

In [129]:
pd.isnull(df1)

                A      B      C      D      F      E
2000-01-01  False  False  False  False   True  False
2000-01-02  False  False  False  False  False  False
2000-01-03  False  False  False  False  False   True
2000-01-04  False  False  False  False  False   True

In [130]:
df.mean()

A    0.343679
B   -0.286454
C    0.006827
D    5.000000
F    3.500000
dtype: float64

In [131]:
df.mean(1)

2000-01-01    1.263626
2000-01-02    1.966127
2000-01-03    1.327445
2000-01-04    1.437911
2000-01-05    2.407776
2000-01-06    1.658859
2000-01-07    1.573969
2000-01-08    1.149370
Freq: D, dtype: float64

In [132]:
df

                   A         B         C  D    F
2000-01-01  0.000000  0.000000  0.054502  5  NaN
2000-01-02  2.870900 -0.359344  1.319081  5  1.0
2000-01-03  0.503640 -1.099415  0.233002  5  2.0
2000-01-04 -0.958737  0.606821 -0.458531  5  3.0
2000-01-05  1.059014  0.982977  0.996888  5  4.0
2000-01-06 -0.051939 -0.590335 -1.063429  5  5.0
2000-01-07 -0.032117 -1.705473 -1.392565  5  6.0
2000-01-08 -0.641326 -0.126865  0.365669  5  NaN

# Operaion

In [138]:
s = pd.Series([1,3,5,np.nan, 6,8,1,1], index=dates).shift(2)

In [136]:
s

2000-01-01    NaN
2000-01-02    NaN
2000-01-03    1.0
2000-01-04    3.0
2000-01-05    5.0
2000-01-06    NaN
2000-01-07    6.0
2000-01-08    8.0
Freq: D, dtype: float64

In [139]:
df.sub(s, axis='index')

                   A         B         C    D    F
2000-01-01       NaN       NaN       NaN  NaN  NaN
2000-01-02       NaN       NaN       NaN  NaN  NaN
2000-01-03 -0.496360 -2.099415 -0.766998  4.0  1.0
2000-01-04 -3.958737 -2.393179 -3.458531  2.0  0.0
2000-01-05 -3.940986 -4.017023 -4.003112  0.0 -1.0
2000-01-06       NaN       NaN       NaN  NaN  NaN
2000-01-07 -6.032117 -7.705473 -7.392565 -1.0  0.0
2000-01-08 -8.641326 -8.126865 -7.634331 -3.0  NaN

In [140]:
df

                   A         B         C  D    F
2000-01-01  0.000000  0.000000  0.054502  5  NaN
2000-01-02  2.870900 -0.359344  1.319081  5  1.0
2000-01-03  0.503640 -1.099415  0.233002  5  2.0
2000-01-04 -0.958737  0.606821 -0.458531  5  3.0
2000-01-05  1.059014  0.982977  0.996888  5  4.0
2000-01-06 -0.051939 -0.590335 -1.063429  5  5.0
2000-01-07 -0.032117 -1.705473 -1.392565  5  6.0
2000-01-08 -0.641326 -0.126865  0.365669  5  NaN

# apply

In [141]:
df.apply(np.cumsum)

                   A         B         C   D     F
2000-01-01  0.000000  0.000000  0.054502   5   NaN
2000-01-02  2.870900 -0.359344  1.373584  10   1.0
2000-01-03  3.374539 -1.458760  1.606586  15   3.0
2000-01-04  2.415802 -0.851939  1.148055  20   6.0
2000-01-05  3.474816  0.131038  2.144943  25  10.0
2000-01-06  3.422877 -0.459297  1.081514  30  15.0
2000-01-07  3.390760 -2.164770 -0.311051  35  21.0
2000-01-08  2.749435 -2.291635  0.054618  40   NaN

In [142]:
df.apply(lambda x:x.max() - x.min())

A    3.829637
B    2.688451
C    2.711647
D    0.000000
F    5.000000
dtype: float64

# histogram

In [143]:
s = pd.Series(np.random.randint(0,7,size=10))

In [144]:
s

0    2
1    0
2    3
3    3
4    5
5    0
6    3
7    1
8    2
9    4
dtype: int32

In [146]:
s.value_counts()

3    3
2    2
0    2
5    1
4    1
1    1
dtype: int64

In [147]:
s = pd.Series(['A','B','C','Aaba','Baca',np.nan, 'CABA','dog','cat'])

In [149]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# merge

In [151]:
df = pd.DataFrame(np.random.randn(10,4))

In [152]:
df

          0         1         2         3
0 -1.653474 -0.179735 -0.185833 -1.105917
1  1.204814  1.736984 -0.145953  1.160209
2 -0.610897 -0.866695  0.753934 -0.225218
3 -1.069079  2.038859  0.362730  0.390925
4  3.299575 -0.553815  0.853278 -0.380907
5 -0.024634  0.362161 -0.054647  1.836861
6  0.151882 -0.107396  1.553923 -3.583430
7 -1.703799 -0.250515 -0.202257 -1.345213
8  1.640042 -0.664356  0.299085 -0.170557
9  0.692138 -0.824580  0.513538  2.001585

In [153]:
pieces = [df[:3], df[3:7], df[7:]]

In [154]:
pieces

[          0         1         2         3
 0 -1.653474 -0.179735 -0.185833 -1.105917
 1  1.204814  1.736984 -0.145953  1.160209
 2 -0.610897 -0.866695  0.753934 -0.225218,
           0         1         2         3
 3 -1.069079  2.038859  0.362730  0.390925
 4  3.299575 -0.553815  0.853278 -0.380907
 5 -0.024634  0.362161 -0.054647  1.836861
 6  0.151882 -0.107396  1.553923 -3.583430,
           0         1         2         3
 7 -1.703799 -0.250515 -0.202257 -1.345213
 8  1.640042 -0.664356  0.299085 -0.170557
 9  0.692138 -0.824580  0.513538  2.001585]

In [155]:
pd.concat(pieces)

          0         1         2         3
0 -1.653474 -0.179735 -0.185833 -1.105917
1  1.204814  1.736984 -0.145953  1.160209
2 -0.610897 -0.866695  0.753934 -0.225218
3 -1.069079  2.038859  0.362730  0.390925
4  3.299575 -0.553815  0.853278 -0.380907
5 -0.024634  0.362161 -0.054647  1.836861
6  0.151882 -0.107396  1.553923 -3.583430
7 -1.703799 -0.250515 -0.202257 -1.345213
8  1.640042 -0.664356  0.299085 -0.170557
9  0.692138 -0.824580  0.513538  2.001585

# join

In [157]:
left = pd.DataFrame({'key':['foo','foo'], 'lval':[1,2]})

In [158]:
right = pd.DataFrame({'key':['foo','foo'], 'rval':[4,5]})

In [159]:
left

   key  lval
0  foo     1
1  foo     2

In [161]:
right

   key  rval
0  foo     4
1  foo     5

In [162]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [163]:
left = pd.DataFrame({'key':['foo','bar'], 'lval':[1,2]})
right = pd.DataFrame({'key':['foo','bar'], 'rval':[4,5]})

In [164]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Append

In [165]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A','B','C','D'])

In [166]:
df

          A         B         C         D
0  0.101595 -1.092266  0.059955  0.804272
1 -1.401297 -1.086694  2.200848  0.570854
2 -0.647927  0.560762 -0.783134  0.097738
3  0.336957 -1.256313  0.333912 -1.460067
4 -2.097406  2.038738 -0.363070 -1.015190
5 -0.455787 -1.545484  0.420373 -0.811427
6 -0.301407  1.825724 -0.808246  1.922913
7 -0.225265 -0.387929 -0.842340 -1.279047

In [167]:
s = df.iloc[3]

In [168]:
s

A    0.336957
B   -1.256313
C    0.333912
D   -1.460067
Name: 3, dtype: float64

In [169]:
df.append(s, ignore_index=True)

          A         B         C         D
0  0.101595 -1.092266  0.059955  0.804272
1 -1.401297 -1.086694  2.200848  0.570854
2 -0.647927  0.560762 -0.783134  0.097738
3  0.336957 -1.256313  0.333912 -1.460067
4 -2.097406  2.038738 -0.363070 -1.015190
5 -0.455787 -1.545484  0.420373 -0.811427
6 -0.301407  1.825724 -0.808246  1.922913
7 -0.225265 -0.387929 -0.842340 -1.279047
8  0.336957 -1.256313  0.333912 -1.460067

# Grouping

In [171]:
df = pd.DataFrame({'A':['foo','bar','foo','bar',
                        'foo','bar','foo','foo'],
                  'B':['one','one','two','three',
                      'two','two','one','three'],
                  'C':np.random.randn(8),
                  'D':np.random.randn(8)})

In [172]:
df

     A      B         C         D
0  foo    one  0.051955  0.098845
1  bar    one  0.385784 -0.151545
2  foo    two  0.188670  0.781513
3  bar  three  0.617924 -0.517224
4  foo    two -2.465793  0.196146
5  bar    two -1.231067 -0.648334
6  foo    one  0.054365 -1.438839
7  foo  three  0.165382 -1.701287

In [173]:
df.groupby('A').sum()

            C         D
A
bar -0.227359 -1.317103
foo -2.005422 -2.063622

In [174]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    0.385784 -0.151545
    three  0.617924 -0.517224
    two   -1.231067 -0.648334
foo one    0.106320 -1.339994
    three  0.165382 -1.701287
    two   -2.277123  0.977659

# reshaping

In [187]:
tuples = list(zip(*[['bar','bar','baz','baz',
                   'foo','foo','qux','qux'],
                  ['one','two','one','two',
                  'one','two','one','two']]))

In [188]:
tuples

[('bar', 'one'),
 ('bar', 'two'),
 ('baz', 'one'),
 ('baz', 'two'),
 ('foo', 'one'),
 ('foo', 'two'),
 ('qux', 'one'),
 ('qux', 'two')]

In [190]:
index = pd.MultiIndex.from_tuples(tuples, names=['first','second'])

In [191]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [192]:
df = pd.DataFrame(np.random.randn(8,2), index=index, columns=['A','B'])

In [193]:
df

                     A         B
first second
bar   one     2.118210 -0.540161
      two     0.036503 -0.933536
baz   one    -0.390046  1.101216
      two     0.228583 -0.005550
foo   one    -0.639087  0.929625
      two    -0.565981 -1.096698
qux   one    -0.166566 -1.147056
      two    -1.237048  0.974970

In [183]:
df2 = df[:4]

In [184]:
df2

                     A         B
first second
bar   one    -0.664194 -1.011415
      two    -1.467829 -0.141406
baz   one     1.466784 -1.247840
      two    -0.419631 -0.197077

In [194]:
stacked = df2.stack()

In [195]:
stacked

first  second
bar    one     A   -0.664194
               B   -1.011415
       two     A   -1.467829
               B   -0.141406
baz    one     A    1.466784
               B   -1.247840
       two     A   -0.419631
               B   -0.197077
dtype: float64

In [200]:
stacked.unstack()

                     A         B
first second
bar   one    -0.664194 -1.011415
      two    -1.467829 -0.141406
baz   one     1.466784 -1.247840
      two    -0.419631 -0.197077

In [197]:
stacked.unstack(1)

second        one       two
first
bar   A -0.664194 -1.467829
      B -1.011415 -0.141406
baz   A  1.466784 -0.419631
      B -1.247840 -0.197077

In [201]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.664194  1.466784
       B -1.011415 -1.247840
two    A -1.467829 -0.419631
       B -0.141406 -0.197077

# pivot

In [203]:
df = pd.DataFrame({'A':['one','one','two','three']*3,
                   'B':['A','B','C']*4,
                   'C':['foo','foo','foo','bar','bar','bar']*2,
                   'D':np.random.randn(12),
                   'E':np.random.randn(12)})

In [204]:
df

        A  B    C         D         E
0     one  A  foo  0.765037 -0.452714
1     one  B  foo  0.623184 -0.218801
2     two  C  foo  1.991698  2.939155
3   three  A  bar -0.958375  0.931023
4     one  B  bar -1.073360 -0.021011
5     one  C  bar  1.609440  0.406370
6     two  A  foo -0.331662 -0.446926
7   three  B  foo  0.773581 -0.061013
8     one  C  foo -0.950120 -0.826880
9     one  A  bar -1.472749  0.670928
10    two  B  bar -1.813168  0.178190
11  three  C  bar -0.467140 -1.826928

In [207]:
pd.pivot_table(df, values='D', index=['A','B'], columns=['C'])

C             bar       foo
A     B
one   A -1.472749  0.765037
      B -1.073360  0.623184
      C  1.609440 -0.950120
three A -0.958375       NaN
      B       NaN  0.773581
      C -0.467140       NaN
two   A       NaN -0.331662
      B -1.813168       NaN
      C       NaN  1.991698

# Time series

In [211]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [212]:
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='S')

In [210]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index= rng)

In [219]:
ts.resample('5Min').sum()

2012-01-01    24138
Freq: 5T, dtype: int32

In [220]:
rng = pd.date_range('3/6/2012 00:00', periods=5, freq='D')

In [221]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [222]:
ts = pd.Series(np.random.randn(len(rng)), rng)

In [223]:
ts

2012-03-06   -0.837777
2012-03-07    0.314201
2012-03-08    2.741978
2012-03-09    1.186451
2012-03-10    0.070434
Freq: D, dtype: float64

# Time Series - convert timezone

In [228]:
ts_utc = ts.tz_localize('UTC')

In [225]:
ts_utc

2012-03-06 00:00:00+00:00   -0.837777
2012-03-07 00:00:00+00:00    0.314201
2012-03-08 00:00:00+00:00    2.741978
2012-03-09 00:00:00+00:00    1.186451
2012-03-10 00:00:00+00:00    0.070434
Freq: D, dtype: float64

In [230]:
ts_utc.tz_convert('Asia/Seoul')

2012-03-06 09:00:00+09:00   -0.837777
2012-03-07 09:00:00+09:00    0.314201
2012-03-08 09:00:00+09:00    2.741978
2012-03-09 09:00:00+09:00    1.186451
2012-03-10 09:00:00+09:00    0.070434
Freq: D, dtype: float64

In [231]:
rng = pd.date_range('1/1/2012', periods=5, freq='M')

In [232]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [233]:
ts

2012-01-31   -1.557560
2012-02-29    0.386592
2012-03-31    0.504641
2012-04-30    1.468574
2012-05-31   -0.406204
Freq: M, dtype: float64

In [234]:
ps = ts.to_period()

In [235]:
ps

2012-01   -1.557560
2012-02    0.386592
2012-03    0.504641
2012-04    1.468574
2012-05   -0.406204
Freq: M, dtype: float64

In [236]:
ps.to_timestamp()

2012-01-01   -1.557560
2012-02-01    0.386592
2012-03-01    0.504641
2012-04-01    1.468574
2012-05-01   -0.406204
Freq: MS, dtype: float64

In [237]:
ps.to_timestamp()

2012-01-01   -1.557560
2012-02-01    0.386592
2012-03-01    0.504641
2012-04-01    1.468574
2012-05-01   -0.406204
Freq: MS, dtype: float64

In [239]:
prng = pd.period_range('1990Q1','2000Q4', freq='Q-NOV')

In [240]:
prng

PeriodIndex(['1990Q1', '1990Q2', '1990Q3', '1990Q4', '1991Q1', '1991Q2',
             '1991Q3', '1991Q4', '1992Q1', '1992Q2', '1992Q3', '1992Q4',
             '1993Q1', '1993Q2', '1993Q3', '1993Q4', '1994Q1', '1994Q2',
             '1994Q3', '1994Q4', '1995Q1', '1995Q2', '1995Q3', '1995Q4',
             '1996Q1', '1996Q2', '1996Q3', '1996Q4', '1997Q1', '1997Q2',
             '1997Q3', '1997Q4', '1998Q1', '1998Q2', '1998Q3', '1998Q4',
             '1999Q1', '1999Q2', '1999Q3', '1999Q4', '2000Q1', '2000Q2',
             '2000Q3', '2000Q4'],
            dtype='period[Q-NOV]', freq='Q-NOV')

In [241]:
ts = pd.Series(np.random.randn(len(prng)), prng)

In [242]:
ts.index = (prng.asfreq('M','e') + 1).asfreq('H','s') + 9

In [243]:
ts.head()

1990-03-01 09:00   -1.110529
1990-06-01 09:00   -1.889345
1990-09-01 09:00   -0.120819
1990-12-01 09:00    0.376901
1991-03-01 09:00    0.204293
Freq: H, dtype: float64

# Categorical data

In [256]:
df = pd.DataFrame({"id":[1,2,3,4,5,6], "raw_grade":['a','b','b','a','a','e']})

In [257]:
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

In [258]:
df["grade"] = df["raw_grade"].astype("category")

In [259]:
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): [a, b, e]

In [260]:
df["grade"].cat.categories = ["very good","good","very bad"]

In [255]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [262]:
df["grade"] = df["grade"].cat.set_categories(["very bad","bad","medium","good","very good"])

In [263]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [253]:
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): [very bad, bad, medium, good, very good]

In [264]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

In [265]:
df.groupby("grade").size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

# Getting Data In/Out

In [266]:
df.to_csv('foo.csv')

In [270]:
test=pd.read_csv('foo.csv')

In [271]:
del test["Unnamed: 0"]

In [272]:
test

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

In [268]:
df.to_excel('foo.xlsx', sheet_name='Sheet1')

In [269]:
pd.read_excel('foo.xlsx', 'Sheet1', index_col=None, na_values=['NA'])

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad